// 题目
/*
哪些设计模式
单例模式的多线程安全问题
*/

// 解答
/*
常见的设计模式如下：
单例模式：
    单例模式主要解决一个全局使用的类频繁的创建和销毁的问题。
    单例模式下可以确保某一个类只有一个实例，而且自行实例化并向整个系统提供这个实例。
    单例模式有三个要素：
        一是某个类只能有一个实例；
        二是它必须自行创建这个实例；
        三是它必须自行向整个系统提供这个实例。

工厂模式：
    工厂模式主要解决接口选择的问题。
    该模式下定义一个创建对象的接口，让其子类自己决定实例化哪一个工厂类，使其创建过程延迟到子类进行。

观察者模式：
    定义对象间的一种一对多的依赖关系，当一个对象的状态发生改变时，所有依赖于它的对象都得到通知并被自动更新。


单例模式的多线程安全问题：

在单例模式的实现中，如果不采取任何措施，在多线程下是不安全的，可能会同时创建多个实例。
因此，为了保证单例模式在多线程下的线程安全，一般采用下面几种方式实现单例模式：

1)饿汉式：基于class loader机制避免多线程的同步问题，不过，instance在类装载时就实例化，可能会产生垃圾对象。

2)懒汉式：通过双重锁机制实现线程安全。

*/