// 题目
/*
HTTP和HTTPS的区别，以及HTTPS有什么缺点
*/

// 解答
/*
HTTP协议和HTTPS协议区别如下：
    1）HTTP协议是以明文的方式在网络中传输数据，而HTTPS协议传输的数据则是经过TLS加密后的，HTTPS具有更高的安全性

    2）HTTPS在TCP三次握手阶段之后，还需要进行SSL 的handshake，协商加密使用的对称加密密钥

    3）HTTPS协议需要服务端申请证书，浏览器端安装对应的根证书

    4）HTTP协议端口是80，HTTPS协议端口是443

HTTPS优点：

    HTTPS传输数据过程中使用密钥进行加密，所以安全性更高

    HTTPS协议可以认证用户和服务器，确保数据发送到正确的用户和服务器

HTTPS缺点：

    HTTPS握手阶段延时较高：由于在进行HTTP会话之前还需要进行SSL握手，因此HTTPS协议握手阶段延时增加

    HTTPS部署成本高：一方面HTTPS协议需要使用证书来验证自身的安全性，所以需要购买CA证书；另一方面由于采用HTTPS协议需要进行加解密的计算，占用CPU资源较多，需要的服务器配置或数目高
*/