// 题目
/*
OSI七层模型和TCP/IP四层模型，每层列举2个协议
*/

// 解答
/*
OSI七层模型及其包含的协议如下:
    物理层: 通过媒介传输比特,确定机械及电气规范,传输单位为bit，主要包括的协议为：IEE802.3 CLOCK RJ45
    数据链路层: 将比特组装成帧和点到点的传递,传输单位为帧,主要包括的协议为MAC VLAN PPP
    网络层：负责数据包从源到宿的传递和网际互连，传输单位为包,主要包括的协议为IP ARP ICMP
    传输层：提供端到端的可靠报文传递和错误恢复，传输单位为报文,主要包括的协议为TCP UDP
    会话层：建立、管理和终止会话，传输单位为SPDU，主要包括的协议为RPC NFS
    表示层: 对数据进行翻译、加密和压缩,传输单位为PPDU，主要包括的协议为JPEG ASII
    应用层: 允许访问OSI环境的手段,传输单位为APDU，主要包括的协议为FTP HTTP DNS


TCP/IP 4层模型包括：

    网络接口层（数据链路层）：MAC VLAN

    网络层:IP ARP ICMP

    传输层:TCP UDP

    应用层:HTTP DNS SMTP


*/